Repository: AlanRoyMiller/royal_imbau
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, es

source: Modern Remodeling and Tiling Specialists
de: Spezialisten für moderne Renovierung und Fliesenarbeiten
es: Especialistas en reformas modernas y alicatados

source: Specializing in contemporary tiling and remodeling, we aim to rejuvenate spaces, ranging from bathrooms to kitchens and entire homes. Our goal is to make your space not just visually stunning but also a testament to your elegance and style.
de: Als Experten für moderne Fliesenarbeiten und Renovierungen bringen wir neuen Schwung in jeden Raum – vom Bad über die Küche bis zum gesamten Haus. Unser Ziel ist es, Ihr Zuhause nicht nur optisch aufzuwerten, sondern auch Ihre Eleganz und Ihren Stil zum Ausdruck zu bringen.
es: Especializados en alicatados y reformas contemporáneas, buscamos renovar espacios, desde baños y cocinas hasta viviendas completas. Nuestro objetivo es lograr que tu espacio no solo sea visualmente impactante, sino también un reflejo de tu elegancia y estilo.

source: Contemporary tiled patio area
de: Modern gefliester Terrassenbereich
es: Patio contemporáneo alicatado

source: Transforming Visions into Reality
de: Visionen werden Wirklichkeit
es: Transformando visiones en realidad

source: We specialize in offering contemporary and luxurious touches for those with an eye for the extraordinary. Transforming your vision into your dream home is our commitment, and your pleasure inspires us daily.
de: Wir bieten moderne und luxuriöse Akzente für alle, die das Besondere schätzen. Ihre Vision in Ihr Traumhaus zu verwandeln ist unser Anspruch – Ihre Zufriedenheit inspiriert uns jeden Tag.
es: Nos especializamos en ofrecer detalles contemporáneos y lujosos para quienes buscan lo extraordinario. Convertir tu visión en la casa de tus sueños es nuestro compromiso, y tu satisfacción nos inspira cada día.

source: Luxurious kitchen remodel
de: Luxuriöse Küchenrenovierung
es: Reforma de cocina lujosa

source: Embrace Your Home Journey with Us
de: Gestalten Sie Ihr Zuhause gemeinsam mit uns
es: Vive tu experiencia de hogar con nosotros

source: Let us join you on your journey to create something truly spectacular. Choose Royal Imbau, where your dream home awaits.
de: Lassen Sie uns gemeinsam etwas Außergewöhnliches schaffen. Wählen Sie Royal Imbau – Ihr Traumhaus wartet schon auf Sie.
es: Permítenos acompañarte en tu camino para crear algo realmente espectacular. Elige Royal Imbau, donde te espera la casa de tus sueños.

source: Elegant outdoor living space
de: Eleganter Außenwohnbereich
es: Espacio exterior elegante

source: contact us via whatsapp
de: Kontaktieren Sie uns über WhatsApp
es: contáctanos por WhatsApp

source: Contact Us via Whatsapp
de: Kontaktieren Sie uns über WhatsApp
es: Contáctanos por WhatsApp

source: Royal Imbau specializes in transformative home and commercial renovations, merging innovative designs with expert craftsmanship to bring your vision to life. Revitalize your space with us today!
es: Royal Imbau se especializa en reformas transformadoras de viviendas y comercios, combinando diseños innovadores con una ejecución experta para hacer realidad tu visión. ¡Revitaliza tu espacio con nosotros hoy!

source: Royal Imbau logo
es: Logo de Royal Imbau

source: Home
de: Startseite
es: Inicio

source: About
de: Über uns
es: Acerca de

source: Gallery
de: Galerie
es: Galería

source: Visit our Instagram page
de: Besuchen Sie uns auf Instagram
es: Visita nuestra página de Instagram

source: Visit our Facebook page
de: Besuchen Sie uns auf Facebook
es: Visita nuestra página de Facebook

source: Contact us via WhatsApp
de: Kontaktieren Sie uns über WhatsApp
es: Contáctanos por WhatsApp

source: Some of our work
de: Einige unserer Arbeiten
es: Algunos de nuestros trabajos

source: Description of Image 38
de: Beschreibung von Bild 38
es: Descripción de la imagen 38

source: Description of Image 39
de: Beschreibung von Bild 39
es: Descripción de la imagen 39

source: Description of Image 26
de: Beschreibung von Bild 26
es: Descripción de la imagen 26

source: Description of Image 27
de: Beschreibung von Bild 27
es: Descripción de la imagen 27

source: Kitchen Renovation
de: Küchensanierung
es: Reforma de cocina

source: Description of Image 6
de: Beschreibung von Bild 6
es: Descripción de la imagen 6

source: Description of Image 7
de: Beschreibung von Bild 7
es: Descripción de la imagen 7

source: Description of Image 8
de: Beschreibung von Bild 8
es: Descripción de la imagen 8

source: Description of Image 9
de: Beschreibung von Bild 9
es: Descripción de la imagen 9

source: Description of Image 10
de: Beschreibung von Bild 10
es: Descripción de la imagen 10

source: Description of Image 11
de: Beschreibung von Bild 11
es: Descripción de la imagen 11

source: Description of Image 12
de: Beschreibung von Bild 12
es: Descripción de la imagen 12

source: Description of Image 13
de: Beschreibung von Bild 13
es: Descripción de la imagen 13

source: Description of Image 14
de: Beschreibung von Bild 14
es: Descripción de la imagen 14

source: Description of Image 15
de: Beschreibung von Bild 15
es: Descripción de la imagen 15

source: Description of Image 16
de: Beschreibung von Bild 16
es: Descripción de la imagen 16

source: Description of Image 17
de: Beschreibung von Bild 17
es: Descripción de la imagen 17

source: Description of Image 18
de: Beschreibung von Bild 18
es: Descripción de la imagen 18

source: Description of Image 19
de: Beschreibung von Bild 19
es: Descripción de la imagen 19

source: Description of Image 20
de: Beschreibung von Bild 20
es: Descripción de la imagen 20

source: Description of Image 21
de: Beschreibung von Bild 21
es: Descripción de la imagen 21

source: Description of Image 22
de: Beschreibung von Bild 22
es: Descripción de la imagen 22

source: Description of Image 23
de: Beschreibung von Bild 23
es: Descripción de la imagen 23

source: Description of Image 24
de: Beschreibung von Bild 24
es: Descripción de la imagen 24

source: Description of Image 25
de: Beschreibung von Bild 25
es: Descripción de la imagen 25

source: Description of Image 37
de: Beschreibung von Bild 37
es: Descripción de la imagen 37

source: Description of Image 29
de: Beschreibung von Bild 29
es: Descripción de la imagen 29

source: Description of Image 30
de: Beschreibung von Bild 30
es: Descripción de la imagen 30

source: Description of Image 0
de: Beschreibung von Bild 0
es: Descripción de la imagen 0

source: Description of Image 1
de: Beschreibung von Bild 1
es: Descripción de la imagen 1

source: Dreaming of a new
de: Träumen Sie von einem neuen
es: ¿Soñando con un nuevo

source: Shape your dreams into reality with our specialized construction services.
de: Verwirklichen Sie Ihre Träume mit unseren spezialisierten Baudienstleistungen.
es: Haz realidad tus sueños con nuestros servicios especializados de construcción.

source: Get Started
de: Jetzt starten
es: Comenzar

source: We are a team of talented professionals dedicated to delivering the best remodeling services in the area.
de: Wir sind ein Team talentierter Fachleute, das sich der besten Renovierungsarbeit in der Region verschrieben hat.
es: Somos un equipo de profesionales talentosos dedicados a ofrecer los mejores servicios de remodelación en la zona.

source: Learn More About Us
de: Mehr über uns erfahren
es: Conoce más sobre nosotros

source: Founded and delivering excellence ever since.
de: Gegründet und seitdem stets exzellente Leistungen erbracht.
es: Fundada y brindando excelencia desde entonces.

source: Houses transformed into dream homes.
de: Häuser in Traumhäuser verwandelt.
es: Casas transformadas en hogares de ensueño.

source: Happy customers and counting.
de: Zufriedene Kunden und es werden immer mehr.
es: Clientes satisfechos y seguimos sumando.

source: A team of highly Skilled workers dedicated to your project's success.
de: Ein Team hochqualifizierter Fachkräfte, das sich dem Erfolg Ihres Projekts widmet.
es: Un equipo de trabajadores altamente calificados dedicados al éxito de tu proyecto.

source: All of our services
de: Alle unsere Dienstleistungen
es: Todos nuestros servicios

source: Full renovations
de: Komplettsanierungen
es: Reformas integrales

source: Carpentry
de: Tischlerarbeiten
es: Carpintería

source: Plumbing
de: Sanitärarbeiten
es: Fontanería

source: Painting
de: Malerarbeiten
es: Pintura

source: Bathrooms and Kitchens
de: Bäder und Küchen
es: Baños y cocinas

source: Tiling and Paving
de: Fliesen- und Pflasterarbeiten
es: Alicatados y pavimentos

source: Furniture Fitting
de: Möbelmontage
es: Montaje de muebles

source: Electrical
de: Elektroarbeiten
es: Electricidad

source: A first glance of what we can do
de: Ein erster Eindruck von unseren Möglichkeiten
es: Un primer vistazo a lo que podemos hacer

source: View our full Gallery...
de: Unsere gesamte Galerie ansehen...
es: Ver nuestra galería completa...

source: What Our Customers Say
de: Was unsere Kunden sagen
es: Lo que dicen nuestros clientes

source: Ready to transform your space?
de: Bereit, Ihren Raum zu verwandeln?
es: ¿Listo para transformar tu espacio?

source: Or send us a Message
de: Oder senden Sie uns eine Nachricht
es: O envíanos un mensaje

source: 🎉 Your message was sent successfully!
de: 🎉 Ihre Nachricht wurde erfolgreich gesendet!
es: 🎉 ¡Tu mensaje fue enviado con éxito!

source: ❌ There was a problem sending your message:
de: ❌ Beim Senden Ihrer Nachricht ist ein Problem aufgetreten:
es: ❌ Hubo un problema al enviar tu mensaje:

source: Send Message
de: Nachricht senden
es: Enviar mensaje

source: Give us a Call
de: Rufen Sie uns an
es: Llámanos

source: Address
de: Adresse
es: Dirección

source: Kitchen?
de: Küche?
es: ¿Cocina?

source: Bathroom?
de: Badezimmer?
es: ¿Baño?

source: Bedroom?
de: Schlafzimmer?
es: ¿Dormitorio?

source: Living Room?
de: Wohnzimmer?
es: ¿Salón?

source: Dining Room?
de: Esszimmer?
es: ¿Comedor?

source: Home Office?
de: Arbeitszimmer?
es: Oficina?

source: Playroom?
de: Spielzimmer?
es: ¿Sala de juegos?

source: Basement?
de: Keller?
es: ¿Sótano?

source: Attic?
de: Dachboden?
es: ¿Ático?

source: Home Theater?
de: Heimkino?
es: ¿Cine en casa?

source: Gym?
de: Fitnessraum?
es: ¿Gimnasio?

source: Pool?
es: ¿Piscina?

source: Deck?
es: ¿Terraza?

source: Porch?
de: Veranda?
es: ¿Porche?

source: Backyard?
de: Hinterhof?
es: ¿Jardín trasero?

source: Garden?
de: Garten?
es: ¿Jardín?

source: Garage?
es: ¿Garaje?

source: Pavement?
de: Gehweg?
es: ¿Pavimento?

source: Staircase?
de: Treppe?
es: ¿Escalera?

source: Balcony?
de: Balkon?
es: ¿Balcón?

source: Roof?
de: Dach?
es: ¿Tejado?

source: Company logo
de: Firmenlogo
es: Logo de la empresa

source: Select language
es: Seleccionar idioma

source: English
es: Inglés

source: Spanish
es: Español

source: German
es: Alemán

source: Mobile menu button
de: Menüknopf für Mobilgeräte
es: Botón del menú móvil

source: Royal Imbau is a renovation company led by a modern tiling specialist, offering expert home and commercial renovations, contemporary remodeling, and quality craftsmanship. Transform your space with innovative designs and professional tiling. Contact us for your next project!
de: Royal Imbau ist ein Renovierungsunternehmen unter der Leitung eines modernen Fliesenspezialisten. Wir bieten fachkundige Renovierungen für Wohn- und Gewerberäume, zeitgemäße Modernisierungen und hochwertige Handwerkskunst. Verwandeln Sie Ihren Raum mit innovativen Designs und professionellen Fliesenarbeiten. Kontaktieren Sie uns für Ihr nächstes Projekt!

source: Patio?
de: Terrasse?

source: Contact
de: Kontakt
